export const url = `http://${window.location.hostname}:8080`;
// export const url = `http://studentsystem.xyz:8080`;  //Чтобы тестировать раскомментируй это, но когда коммитишь верни обратно либо убери с файла галочку чтобы не коммитнулось

export let timetable = {
    "ИС-20-Д": {
        "Понедельник": [
            [
                "Теория вероятностей. Математическая статистика.",
                "8:40–10:15",
                "лекция",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "Китайский язык",
                "10:30–12:05",
                "практика",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "Математическое моделирование",
                "12:20–13:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Вторник": [
            [
                "Математическое моделирование",
                "14:30–16:05",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ],
            [
                "Физ-ра",
                "16:20–18:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Среда": [
            [
                "Теория вероятностей. Математическая статистика.",
                "8:40–10:15",
                "лекция",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "Китайский язык",
                "10:30–12:05",
                "практика",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "Математическое моделирование",
                "12:20–13:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Четверг": [
            [
                "Математическое моделирование",
                "14:30–16:05",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ],
            [
                "Физ-ра",
                "16:20–18:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Пятница": [
            [
                "Теория вероятностей. Математическая статистика.",
                "8:40–10:15",
                "лекция",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "Китайский язык",
                "10:30–12:05",
                "практика",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "Математическое моделирование",
                "12:20–13:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Суббота": [
            [
                "Математическое моделирование",
                "14:30–16:05",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ],
            [
                "Физ-ра",
                "16:20–18:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ]
    },
    "ИС-21-Д": {
        "Дата начала недели": "24.10.2022",
        "Понедельник": [
            [
                "Теория вероятностей. Математическая статистика.",
                "8:40–10:15",
                "лекция",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "Китайский язык",
                "10:30–12:05",
                "практика",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "Математическое моделирование",
                "12:20–13:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Вторник": [
            [
                "Математическое моделирование",
                "14:30–16:05",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ],
            [
                "Физ-ра",
                "16:20–18:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Среда": [
            [
                "Теория вероятностей. Математическая статистика.",
                "8:40–10:15",
                "лекция",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "Китайский язык",
                "10:30–12:05",
                "практика",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "Математическое моделирование",
                "12:20–13:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Четверг": [
            [
                "Математическое моделирование",
                "14:30–16:05",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ],
            [
                "Физ-ра",
                "16:20–18:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Пятница": [
            [
                "Теория вероятностей. Математическая статистика.",
                "8:40–10:15",
                "лекция",
                "доцент",
                "Смирин О.А.",
                "2-321"
            ],
            [
                "Китайский язык",
                "10:30–12:05",
                "практика",
                "доцент",
                "Цянь Юнь Дзы",
                "2-321"
            ],
            [
                "Математическое моделирование",
                "12:20–13:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ],
        "Суббота": [
            [
                "Математическое моделирование",
                "14:30–16:05",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ],
            [
                "Физ-ра",
                "16:20–18:55",
                "лабораторная",
                "доцент",
                "Шаленков В.К.",
                "2-321"
            ]
        ]
    }
}

export function getCookie(name) {
    const value = `; ${document.cookie}`;
    const parts = value.split(`; ${name}=`);
    if (parts.length === 2) return parts.pop().split(";").shift();
}

export function logout() {
    document.cookie = "TOKEN=null;max-age=0";
    document.cookie = "ID=null;max-age=0";
    window.location.href = '/'
}